CSI API ETABS v1
cAnalysisResultsSetup.GetOptionBaseReactLoc Method
 Retrieves the global coordinates of the location at which the base reactions are reported
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOptionBaseReactLoc(
	ref double GX,
	ref double GY,
	ref double GZ
)
Function GetOptionBaseReactLoc (
	ByRef GX As Double,
	ByRef GY As Double,
	ByRef GZ As Double
) As Integer
Dim instance As cAnalysisResultsSetup
Dim GX As Double
Dim GY As Double
Dim GZ As Double
Dim returnValue As Integer
returnValue = instance.GetOptionBaseReactLoc(GX,
	GY, GZ)
int GetOptionBaseReactLoc(
	double% GX,
	double% GY,
	double% GZ
)
abstract GetOptionBaseReactLoc :
        GX : float byref *
        GY : float byref *
        GZ : float byref -> int
Parameters
GX
Type: System.Double
 The global X coordinate of the location at which the base reactions are reported
GY
Type: System.Double
 The global Y coordinate of the location at which the base reactions are reported
GZ
Type: System.Double
 The global Z coordinate of the location at which the base reactions are reported
Return Value
Type: Int32
 Returns zero if the coordinates are successfully retrieved, otherwise it returns nonzero
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Selected As Boolean
       Dim gx As Double
       Dim gy As Double
       Dim gz As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get base reaction location
       ret = SapModel.Results.Setup.GetOptionBaseReactLoc(gx, gy, gz)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace